
## Plan Result (prod_dns)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.adguard_gamora.adguard_config.config
  * module.adguard_thanos.adguard_config.config


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.adguard_gamora.adguard_config.config will be updated in-place
  ~ resource "adguard_config" "config" {
      ~ dns                             = {
          ~ upstream_dns               = [
                "https://dns10.quad9.net/dns-query",
              + "[/*.home.bancey.xyz/]10.151.14.1",
            ]
            # (24 unchanged attributes hidden)
        }
        id                              = "1"
      ~ last_updated                    = "Thursday, 19-Dec-24 00:15:24 UTC" -> (known after apply)
      ~ tls                             = {
          ~ dns_names          = [] -> (known after apply)
          ~ issuer             = null -> (known after apply)
          ~ key_type           = null -> (known after apply)
          ~ not_after          = null -> (known after apply)
          ~ not_before         = null -> (known after apply)
          ~ private_key_saved  = false -> (known after apply)
          ~ subject            = null -> (known after apply)
          ~ valid_cert         = false -> (known after apply)
          ~ valid_chain        = false -> (known after apply)
          ~ valid_key          = false -> (known after apply)
          ~ valid_pair         = false -> (known after apply)
          ~ warning_validation = null -> (known after apply)
            # (9 unchanged attributes hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.adguard_thanos.adguard_config.config will be updated in-place
  ~ resource "adguard_config" "config" {
      ~ dns                             = {
          ~ upstream_dns               = [
                "https://dns10.quad9.net/dns-query",
              + "[/*.home.bancey.xyz/]10.151.14.1",
            ]
            # (24 unchanged attributes hidden)
        }
        id                              = "1"
      ~ last_updated                    = "Thursday, 19-Dec-24 00:15:25 UTC" -> (known after apply)
      ~ tls                             = {
          ~ dns_names          = [] -> (known after apply)
          ~ issuer             = null -> (known after apply)
          ~ key_type           = null -> (known after apply)
          ~ not_after          = null -> (known after apply)
          ~ not_before         = null -> (known after apply)
          ~ private_key_saved  = false -> (known after apply)
          ~ subject            = null -> (known after apply)
          ~ valid_cert         = false -> (known after apply)
          ~ valid_chain        = false -> (known after apply)
          ~ valid_key          = false -> (known after apply)
          ~ valid_pair         = false -> (known after apply)
          ~ warning_validation = null -> (known after apply)
            # (9 unchanged attributes hidden)
        }
        # (8 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":420,"Program":"tfcmt","SHA1":"","Target":"prod_dns","Vars":{}} -->